# 1
num_1 = 15 * 3
num_2 = 15 / 3
num_3 = 15 // 2
num_4 = 15 ** 2
print(type(num_1) , type(num_2) , type(num_3) , type(num_4))


# 2
list_weater = ['в', '"', '05', '"', 'часов', '"', '17', '"', 'минут', 'температура', 'воздуха', 'была', '"', '+05', '"', 'градусов']
weater_2 = ' '.join(list_weater)
print(weater_2)

# print(weater_2.count(int))
# print(sum(weater_2))
# не придумал как показать числа, мои предположения не сработали


# 4
list_people = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']
print('привет Игорь, привет Марина, привет Николай, привет Аэлита' )
print(id(list_people))
list_people[1] = 'Главный бухгалтер Марина'
list_people[2] = 'токарь высшего разряда Николай'
list_people[3] = 'директор Аэлита'
print(list_people)
print(id(list_people))

#5
price = ['57 руб 8 коп' , '46 руб 51 коп' , '97 руб' , '18 руб' , '54 руб 84 коп' , '91 руб 55 коп' , '95 руб' , '99 руб 99 коп' , '5 руб 04 коп' , '43 руб']
print(price)
print(id(price))

price.sort()
print(price)
print(id(price))  #я не понимаю почему сортурует только по 1 знаку (46.51', '5', '54.84)


price_2 = ['57 руб 8 коп' , '46 руб 51 коп' , '97 руб' , '18 руб' , '54 руб 84 коп' , '91 руб 55 коп' , '95 руб' , '99 руб 99 коп' , '5 руб 04 коп' , '43 руб']
price_2.sort()
price_2.reverse()
print(price_2)


price_2 = price_2[ 0 : 5 ]
price_2.sort()
print(price_2)
